game-bot/src/Documents/СессияПивнойИгры/СессияПивнойИгры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СессияПивнойИгры</name>
  <posting>Deny</posting>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиТелеграм</types>
    </type>
  </attributes>
  <attributes>
    <name>Дистрибьютор</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиТелеграм</types>
    </type>
  </attributes>
  <attributes>
    <name>ОптовыйПродавец</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиТелеграм</types>
    </type>
  </attributes>
  <attributes>
    <name>Ритейлер</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиТелеграм</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРаундов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаРаунда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйСпрос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыеЗапасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыеЗаказы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтрафЗаИзбыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтрафЗаНарушениеЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусИгровойСессии</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияТекущегоРаунда</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийРаунд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзмененияСпроса</name>
    <attributes>
      <name>НомерРаунда</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ХодИгры</name>
    <attributes>
      <name>Заказ1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Запас1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поступление1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходящийЗаказ1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправка1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штраф1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Запас2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поступление2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходящийЗаказ2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправка2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штраф2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Запас3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поступление3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходящийЗаказ3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправка3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штраф3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Запас4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поступление4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходящийЗаказ4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправка4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штраф4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спрос</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

game-bot/src/Documents/СессияПивнойИгры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура РассчитатьРаунд(НомерРаунда) Экспорт
	
	Если НомерРаунда > ХодИгры.Количество() Тогда
		ВызватьИсключение НСтр("ru = 'Раунд еще не начат'");
	КонецЕсли;
	
	ДанныеРаунда = ХодИгры[НомерРаунда - 1];
	
	Если НомерРаунда - СрокДоставки < 1 Тогда
		ПоступившиеОтправки = Неопределено;
	Иначе
		ПоступившиеОтправки = ХодИгры[НомерРаунда - СрокДоставки - 1];
	КонецЕсли;
	
	Если НомерРаунда = 1 Тогда
		ПредыдущийРаунд = Неопределено;
	Иначе
		ПредыдущийРаунд = ХодИгры[НомерРаунда - 2];
	КонецЕсли;
	
	Если НомерРаунда = 1 Тогда
		ДанныеРаунда.Спрос = НачальныйСпрос;
	Иначе
		ДанныеРаунда.Спрос = ПредыдущийРаунд.Спрос;
		Фильтр = Новый Структура;
		Фильтр.Вставить("НомерРаунда", НомерРаунда);
		НайденныеСтроки = ИзмененияСпроса.НайтиСтроки(Фильтр);
		Для Каждого Строка Из НайденныеСтроки Цикл
			ДанныеРаунда.Спрос = ДанныеРаунда.Спрос + Строка.Изменение;
		КонецЦикла;
	КонецЕсли;
	
	Для Сч = 1 По 4 Цикл
		
		// Рассчитываем поступления
		Если ПоступившиеОтправки = Неопределено Тогда
			Поступление = СтартовыеЗаказы;
		Иначе
			Если Сч = 1 Тогда
				Поступление = ПоступившиеОтправки.Заказ1;
			Иначе
				Поступление = ПоступившиеОтправки["Отправка" + (Сч - 1)];
			КонецЕсли;
		КонецЕсли;
		
		Если ПредыдущийРаунд = Неопределено Тогда
			ЗапасНаНачало = СтартовыеЗапасы;
		Иначе
			ЗапасНаНачало = ПредыдущийРаунд["Запас" + Сч];
		КонецЕсли;
		
		Запас = ЗапасНаНачало + Поступление;
		
		// Рассчитываем отправку
		Если Сч = 4 Тогда
			ВходящийЗаказ = ДанныеРаунда.Спрос;
		Иначе
			ВходящийЗаказ = ДанныеРаунда["Заказ" + (Сч + 1)];
		КонецЕсли;
		
		НеобходимоОтправить = ВходящийЗаказ;
		
		Если ПредыдущийРаунд <> Неопределено Тогда
			НеобходимоОтправить = НеобходимоОтправить + ПредыдущийРаунд["Долг" + Сч];
		КонецЕсли;
		
		Отправлено = Мин(НеобходимоОтправить, Запас);
		
		Запас = Запас - Отправлено;
		
		Долг = НеобходимоОтправить - Отправлено;	
		
		ДанныеРаунда["Штраф" + Сч] = Запас * ШтрафЗаИзбыток + Долг * ШтрафЗаНарушениеЗаказа;
			
		ДанныеРаунда["Отправка" + Сч] = Отправлено;
		ДанныеРаунда["Запас" + Сч] = Запас;
		ДанныеРаунда["Долг" + Сч] = Долг;
		
		ДанныеРаунда["Поступление" + Сч] = Поступление;
		ДанныеРаунда["ВходящийЗаказ" + Сч] = ВходящийЗаказ;		
		
	КонецЦикла;			
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти

#КонецЕсли
